Repository: alnazer/wc-knet
Catalog: languages/wc-knet-*.po
Languages: ar

source: KNET
ar: كي نت

source: integration with KNET php raw.
ar: التكامل مع KNET php الخام.

source: Enable/Disable
ar: تمكين / تعطيل

source: Enable KNET Payment
ar: تمكين الدفع عبر كي نت

source: Test mode
ar: النسخة التجريبية

source: Enable Test Mode
ar: تفعيل النسخة التجريبية

source: Place the payment gateway in test mode using test. only this user roles [Shop manager,Administrator] can test payment
ar: ضع بوابة الدفع في وضع الاختبار. يمكن فقط لأدوار هذه [مدير المتجر، المسؤول] اختبار الدفع

source: KNET REDIRECT page
ar: خاصية REDIRECT

source: Enable KNET REDIRECT page
ar: تمكين طباعة REDIRECT في RESPOMSE URL

source: If you were a subscriber to K-Net after 4/9/2023 the date on which this feature was activated
ar: اذا كنت مشترك في الكي نت بعد 9/4/2023 تاريخ تفعيل هذه الخاصية

source: Enable KFAST
ar: تفعيل KFAST

source: KFAST is a new feature, affiliated with KNET Payment Gateway, by which the customer can save their card(s) details, enabling them to carry out any future transactions with the same merchant, in a speedy manner, by only having to enter their PIN when prompted.
ar: KFAST هي ميزة جديدة تابعة لبوابة الدفع KNET، والتي من خلالها يمكن للعميل حفظ تفاصيل بطاقته (بطاقاته)، مما يمكنه من تنفيذ أي معاملات مستقبلية مع نفس التاجر، بطريقة سريعة، بمجرد إدخال رقم التعريف الشخصي (PIN) الخاص به. عندما يُطلب منك ذلك.

source: Title
ar: العنوان

source: This controls the title which the user sees during checkout.
ar: العنوان الذي يراه المستخدم أثناء إتمام الطلبية.

source: Description
ar: الوصف

source: Payment gateway icon
ar: الشعار

source: Please upload the icon For Payment.
ar: الرجاء اختبار ملف الشعار.

source: Complete Order Status
ar: حالة الطلب في حالة نجاح عملية الدفع

source: The state to which the request is transferred upon successful
ar: الحالة التي يتم تحديث الطلب بها عند نجاحه

source: Pending Payment Order Status
ar: حالة الطلب في حالة الشروع في اجراء عملية الدفع

source: The state to which the application is transferred when moving to the payment gateway
ar: الحالة التي يتم نقل الطلب إليها عند الانتقال إلى بوابة الدفع

source: Currency exchange rate
ar: سعر صرف العملة

source: It is the rate of multiplying the currency account in the event that the base currency of the store is not the Kuwaiti dinar
ar: هو معدل ضرب حساب العملة في حالة أن العملة الأساسية للمتجر ليست الدينار الكويتي

source: Payment commission
ar: عمولة بوابة الدفع

source: Charge the transfer commission to the customer. If you want to bear it, leave a zero value
ar: تحميل عمولة التحويل للعميل. إذا كنت تريد أن تتحملها، اترك قيمة صفر

source: Necessary data requested from the bank
ar: البيانات اللازمة المطلوبة من البنك

source: Transportal Password
ar: كلمة مرور Transportal

source: Necessary data requested from the bank
ar: البيانات اللازمة المطلوبة من البنك

source: Language
ar: اللغة

source: payment page lang
ar: لغة صفحة الكي نت

source: Arabic
ar: العربية

source: English
ar: الانجليزية

source: Order not found
ar: الطلب غير موجود

source: Awaiting cheque payment
ar: في انتظار الدفع

source: Payment error:
ar: خطا في عملية الدفع :

source: Knet can't get data
ar: غير قادر علي جلب البيانات من بوابة الكي نت

source: Result
ar: النتيجية

source: Payment id
ar: معرف الدفع (Payment id)

source: track id
ar: معرف التتبع (track id)

source: Transaction id
ar: معرف عملية الدفع (Transaction id)

source: Reference id
ar: الرقم المرجعي (Reference id)

source: Error
ar: خطا

source: Error Message
ar: رسالة الخطا

source: Test Mode
ar: النسخة التجريبية

source: (+) transfer fee
ar: (+) عمولة الدفع

source: Knet details
ar: بيانات الدفع( الكي نت)

source: Tracking id
ar: معرف التتبع (track id)

source: Amount
ar: المبلغ

source: Refrance id
ar: الرقم المرجعي (Refrance id)

source: Created at
ar: أنشئ بتاريخ

source: Thank you. Your order has been
ar: شكرًا لك. طلبك الان

source: Order
ar: طلب

source: no data send form KNET
ar: لم يتم استقبال أي بيانات من الكي نت

source: Payment id is required
ar: معرف عملية الدفع مطلوب

source: Customer Name
ar: اسم العميل

source: Customer Email
ar: بريد العميل

source: Customer Mobile
ar: هاتف البريد

source: Status
ar: الحالة

source: currency must be KWD when using this knet payment
ar: يجب أن تكون العملة دينارًا كويتيًا عند استخدام خدمة الدفع عبر خدمة الكي نت

source: The KFAST feature may not work with all customers because you allow non-customers to make payments
ar: قد لا تعمل ميزة KFAST مع جميع العملاء لأنك تسمح لغير العملاء بإجراء الدفعات

source: WC_Knet_List
ar: قائمة الطلبات

source: Fail
ar: فاشلة

source: Success
ar: ناجحة

source: amount
ar: المبلغ

source: Reset
ar: إعادة تهيئة

source: Export excel
ar: تصدير اكسل

source: Export csv
ar: تصدير csv

source: Knet transactions
ar: سجل عمليات الكي نت
